Revit 2026 API

# PrintParametersPaperSource Property

---

The page source.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSource PaperSource { get; set; }
```
```vb
Public Property PaperSource As PaperSource
	Get
	Set
```
```cpp
public:
property PaperSource^ PaperSource {
	PaperSource^ get ();
	void set (PaperSource^ value);
}
```
```fsharp
member PaperSource : PaperSource with get, set
```

#### Property Value

PaperSource

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument is . |
| ArgumentException | Thrown when the input argument is invalid for current printer. |

User can select the candidate via PaperSources and then set the Page source of the Print Setting.

#### Reference

PrintParameters Class

Autodesk.Revit.DB Namespace